
&НаКлиенте
Процедура ТестReqRep(Команда)
	ТестReqRepНаСервере(ИмяФайла);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестReqRepНаСервере(ИмяФайла)
	
	ВременныйКаталог = ПолучитьИмяВременногоФайла("zeromq") + ПолучитьРазделительПути();
	СоздатьКаталог(ВременныйКаталог);
	
	КонечныеТочки = Новый Массив;
	КонечныеТочки.Добавить("inproc://#1");
	КонечныеТочки.Добавить("ipc://" + ВременныйКаталог + "1");
	КонечныеТочки.Добавить("tcp://127.0.0.1:5556");
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ИмяФайла);
	ПараметрыЗадания.Добавить(КонечныеТочки);
	
	Задание = ФоновыеЗадания.Выполнить("Задания.Сервер1", ПараметрыЗадания);
	
	Если Не ПодключитьВнешнююКомпоненту(ИмяФайла, "MedIgor", ТипВнешнейКомпоненты.Native, 
		ТипПодключенияВнешнейКомпоненты.НеИзолированно) Тогда
		ВызватьИсключение "Не удалось подключить внешнюю компоненту";
	КонецЕсли;
	
	Socket = Новый ("Addin.MedIgor.ZeroMQ.Req");
	
	Для Каждого КонечнаяТочка Из КонечныеТочки Цикл
		ПроверитьКонечнуюТочку(Socket, КонечнаяТочка);
	КонецЦикла;
	
	Для Каждого КонечнаяТочка Из КонечныеТочки Цикл
		ТестБыстродействия(Socket, КонечнаяТочка);
	КонецЦикла;
	
	Socket.Connect(КонечныеТочки[0]);
	Socket.Send(ПолучитьДвоичныеДанныеИзСтроки("Стоп"));
	Ответ = Socket.Recv(1000);
	
	Задание = Задание.ОжидатьЗавершенияВыполнения(1);
	Если Задание.Состояние <> СостояниеФоновогоЗадания.Завершено Тогда
		ВызватьИсключение СтрШаблон("Задание %1", Задание.Состояние);
	КонецЕсли;
	
	УдалитьФайлы(ВременныйКаталог);
	
	Сообщить("Тест выполнен успешно!");
	
КонецПроцедуры


&НаКлиенте
Процедура ТестReqRepMultipart(Команда)
	ТестReqRepMultipartНаСервере(ИмяФайла);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестReqRepMultipartНаСервере(ИмяФайла)
	
	Если Не ПодключитьВнешнююКомпоненту(ИмяФайла, "MedIgor", ТипВнешнейКомпоненты.Native, 
		ТипПодключенияВнешнейКомпоненты.НеИзолированно) Тогда
		ВызватьИсключение "Не удалось подключить внешнюю компоненту";
	КонецЕсли;
	
	КонечнаяТочка = "inproc://#2";
	
	Server = Новый ("Addin.MedIgor.ZeroMQ.Rep");
	Server.Bind(КонечнаяТочка);
	
	Client = Новый ("Addin.MedIgor.ZeroMQ.Req");
	Client.Connect(КонечнаяТочка);
	
	
	Client.SendPart(ПолучитьДвоичныеДанныеИзСтроки("Часть1"));
	Client.SendPart(ПолучитьДвоичныеДанныеИзСтроки("Часть2"));
	Client.Send(ПолучитьДвоичныеДанныеИзСтроки("Часть3"));
	
	Части = Server.RecvMultipart(1000);
	Если Части <> 3 Тогда
		ВызватьИсключение "Получено неверное количество частей запроса";
	КонецЕсли;
	
	Часть1 = ПолучитьСтрокуИзДвоичныхДанных(Server.GetPart(0));
	Часть2 = ПолучитьСтрокуИзДвоичныхДанных(Server.GetPart(1));
	Часть3 = ПолучитьСтрокуИзДвоичныхДанных(Server.GetPart(2));
	
	Если Часть1 <> "Часть1" Или Часть1 <> "Часть1" Или Часть1 <> "Часть1" Тогда
		ВызватьИсключение "Получен неверный запросы";
	КонецЕсли;
	
	Server.Send(ПолучитьДвоичныеДанныеИзСтроки("Ок"));
	
	Ответ = Client.RecvMultipart(1000);
	Если Ответ <> 1 Или ПолучитьСтрокуИзДвоичныхДанных(Client.GetPart(0)) <> "Ок" Тогда
		ВызватьИсключение "Получен неверный ответ";
	КонецЕсли;
	
	Сообщить("Тест выполнен успешно!");
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПроверитьКонечнуюТочку(Socket, КонечнаяТочка)
	
	Socket.Connect(КонечнаяТочка);
	
	Попытка
		Socket.Send(ПолучитьДвоичныеДанныеИзСтроки("123"));
	Исключение
		ВызватьИсключение Socket.LastError;
	КонецПопытки;
	
	Попытка
		Ответ = Socket.Recv(1000);
	Исключение
		ВызватьИсключение Socket.LastError;
	КонецПопытки;
	ПроверитьОтвет(Ответ);
	
	Socket.Disconnect(КонечнаяТочка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестБыстродействия(Socket, КонечнаяТочка)
	
	Socket.Connect(КонечнаяТочка);
	Socket.Send(ПолучитьДвоичныеДанныеИзСтроки("123"));
	Ответ = Socket.Recv(1000);
	
	Количество = 10 * 1000;
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Для К = 1 По Количество Цикл
		Socket.Send(ПолучитьДвоичныеДанныеИзСтроки("123"));
		Ответ = Socket.Recv(1000);
	КонецЦикла;
	Конец = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Socket.Disconnect(КонечнаяТочка);
	Сообщить(СтрШаблон("Конечная точка: ""%1"", длительность: %2 мс, кол-во запросов: %3", КонечнаяТочка, Конец - Начало, Количество));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьОтвет(Ответ)
	
	Если Ответ = Неопределено Тогда
		ВызватьИсключение "Не удалось получить ответ";
	ИначеЕсли ПолучитьСтрокуИзДвоичныхДанных(Ответ) <> "Получено: 123" Тогда
		ВызватьИсключение "Получить неверный ответ";
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТестPubSub(Команда)
	ТестPubSubНаСервере(ИмяФайла);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестPubSubНаСервере(ИмяФайла)
	
	Если Не ПодключитьВнешнююКомпоненту(ИмяФайла, "MedIgor", ТипВнешнейКомпоненты.Native, 
		ТипПодключенияВнешнейКомпоненты.НеИзолированно) Тогда
		ВызватьИсключение "Не удалось подключить внешнюю компоненту";
	КонецЕсли;
	
	КонечнаяТочка = "inproc://topiс1";
	Тема = ПолучитьДвоичныеДанныеИзСтроки("topiс1");
	
	Publisher = Новый ("Addin.MedIgor.ZeroMQ.Pub");
	Publisher.Bind(КонечнаяТочка);
	
	Subscriber = Новый ("Addin.MedIgor.ZeroMQ.Sub");
	Subscriber.Connect(КонечнаяТочка);
	Subscriber.Subscribe(Тема);
	
	Publisher.SendPart(ПолучитьДвоичныеДанныеИзСтроки("ТемаНаКоторуюНиктоНеПодписан"));
	Publisher.Send(ПолучитьДвоичныеДанныеИзСтроки("ТелоКотороеНиктоНеПолучит"));
	
	Для Номер = 1 По 3 Цикл
		Publisher.SendPart(Тема);
		Publisher.Send(ПолучитьДвоичныеДанныеИзСтроки(СтрШаблон("Сообщение%1", XMLСтрока(Номер)), КодировкаТекста.UTF16));
	КонецЦикла;
	
	Для Номер = 1 По 3 Цикл
		Ответ = Subscriber.RecvMultipart(1000);
		Если Ответ <> 2 Тогда
			ВызватьИсключение "Получено неверное сообщение";
		КонецЕсли;
		ПолученнаяТема = ПолучитьСтрокуИзДвоичныхДанных(Subscriber.GetPart(0));
		Если ПолученнаяТема <> "topiс1" Тогда
			ВызватьИсключение "Получена неверная тема";
		КонецЕсли;
		ПолученноеСообщение = ПолучитьСтрокуИзДвоичныхДанных(Subscriber.GetPart(1), КодировкаТекста.UTF16);
		Если ПолученноеСообщение <> СтрШаблон("Сообщение%1", XMLСтрока(Номер)) Тогда
			ВызватьИсключение "Получено неверное сообщение";
		КонецЕсли;
	КонецЦикла;
	
	Subscriber = Неопределено;
	Publisher = Неопределено;
	
	
	// Наоборот тоже можно, чтобы Publisher подключался к Subscriber
	Subscriber = Новый ("Addin.MedIgor.ZeroMQ.Sub");
	Subscriber.Bind(КонечнаяТочка);
	Subscriber.Subscribe(ПолучитьДвоичныеДанныеИзСтроки("")); // Подписка на любую тему
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ИмяФайла);
	ПараметрыЗадания.Добавить(КонечнаяТочка);
	ПараметрыЗадания.Добавить(ПолучитьДвоичныеДанныеИзСтроки("Привет!"));
	ФоновыеЗадания.Выполнить("Задания.Publisher1", ПараметрыЗадания);
	
	Ответ = Subscriber.Recv(1000);
	Если Ответ = Неопределено Или ПолучитьСтрокуИзДвоичныхДанных(Ответ) <> "Привет!" Тогда
		ВызватьИсключение "Получено неверное сообщение";
	КонецЕсли;
	
	Сообщить("Тест выполнен успешно!");
	
КонецПроцедуры


&НаКлиенте
Процедура ТестPushPull(Команда)
	ТестPushPullНаСервере(ИмяФайла);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестPushPullНаСервере(ИмяФайла)
	
	Если Не ПодключитьВнешнююКомпоненту(ИмяФайла, "MedIgor", ТипВнешнейКомпоненты.Native, 
		ТипПодключенияВнешнейКомпоненты.НеИзолированно) Тогда
		ВызватьИсключение "Не удалось подключить внешнюю компоненту";
	КонецЕсли;
	
	КонечнаяТочка = "inproc://topiс1";
	
	// Pull могут подключаться к Push 
	Push = Новый ("Addin.MedIgor.ZeroMQ.Push");
	Push.Bind(КонечнаяТочка);
	
	Pull = Новый ("Addin.MedIgor.ZeroMQ.Pull");
	Pull.Connect(КонечнаяТочка);
	
	Для НомерЗадачи = 1 По 3 Цикл
		Push.Send(ПолучитьДвоичныеДанныеИзСтроки(СтрШаблон("Задача%1", XMLСтрока(НомерЗадачи))));
	КонецЦикла;
	
	Для НомерЗадачи = 1 По 3 Цикл
		Задача = Pull.Recv(100);
		Если Задача = Неопределено 
			Или ПолучитьСтрокуИзДвоичныхДанных(Задача) <> СтрШаблон("Задача%1", XMLСтрока(НомерЗадачи)) Тогда 
			ВызватьИсключение "Получена неверная задача";
		КонецЕсли;
	КонецЦикла;
	
	
	Push = Неопределено;
	Pull = Неопределено;
	
	// И Наоборот: Push могут подключаться к Pull
	Pull = Новый ("Addin.MedIgor.ZeroMQ.Pull");
	Pull.Bind(КонечнаяТочка);
	
	Push = Новый ("Addin.MedIgor.ZeroMQ.Push");
	Push.Connect(КонечнаяТочка);
	
	Push.Send(ПолучитьДвоичныеДанныеИзСтроки("Задача"));
	
	Задача = Pull.Recv(100);
	Если Задача = Неопределено Или ПолучитьСтрокуИзДвоичныхДанных(Задача) <> "Задача" Тогда 
		ВызватьИсключение "Получена неверная задача";
	КонецЕсли;
	
	Сообщить("Тест выполнен успешно!");
	
КонецПроцедуры


&НаКлиенте
Процедура ТестInfo(Команда)
	ТестInfoНаСервере(ИмяФайла);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестInfoНаСервере(ИмяФайла)
	
	Если Не ПодключитьВнешнююКомпоненту(ИмяФайла, "MedIgor", ТипВнешнейКомпоненты.Native, 
		ТипПодключенияВнешнейКомпоненты.НеИзолированно) Тогда
		ВызватьИсключение "Не удалось подключить внешнюю компоненту";
	КонецЕсли;
	
	Info = Новый ("Addin.MedIgor.ZeroMQ.Info");
	Попытка
		Instance = Новый УникальныйИдентификатор(Info.Instance);
	Исключение
		ВызватьИсключение "Не удалось получить свойство Info.Instance";
	КонецПопытки;
	
	Попытка
		Проверка = Новый УникальныйИдентификатор(Info.Instance);
	Исключение
		ВызватьИсключение "Не удалось получить свойство Info.Instance";
	КонецПопытки;
	
	Попытка
		Проверка = Info.VersionZeroMQ;
	Исключение
		ВызватьИсключение "Не удалось получить свойство Info.VersionZeroMQ";
	КонецПопытки;
	
	Попытка
		ВерсияКомпоненты = Info.VersionAddin;
	Исключение
		ВызватьИсключение "Не удалось получить свойство Info.VersionAddin";
	КонецПопытки;
	
	Сообщить(СтрШаблон("Тест выполнен успешно! версия компоненты: %1", ВерсияКомпоненты));
	
КонецПроцедуры
