Процедура Сервер1(ИмяФайла, КонечныеТочки) Экспорт
	
	Если Не ПодключитьВнешнююКомпоненту(ИмяФайла, "MedIgor", ТипВнешнейКомпоненты.Native, 
		ТипПодключенияВнешнейКомпоненты.НеИзолированно) Тогда
		ВызватьИсключение "Не удалось подключить внешнюю компоненту";
	КонецЕсли;
	
	Socket = Новый ("Addin.MedIgor.ZeroMQ.Rep");
	
	Для Каждого КонечнаяТочка Из КонечныеТочки Цикл
		Socket.Bind(КонечнаяТочка);
	КонецЦикла;
	
	Пока Истина Цикл
		ДвоичныеДанные = Socket.Recv(60 * 1000);
		Если ДвоичныеДанные = Неопределено Тогда
			Прервать;
		КонецЕсли;
		Строка = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные);
		Socket.Send(ПолучитьДвоичныеДанныеИзСтроки("Получено: " + Строка));
		Если Строка = "Стоп" Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры